Repository: SpookySandwich/GitIgnoreCleaner
Catalog: GitIgnoreCleaner/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ru_ru, zh_hans

# AppDescription
source: Clean ignored build artifacts and temporary files across your project tree.
ja_jp: ignore ルールに基づいて、プロジェクト内のビルド成果物や一時ファイルをまとめて整理します。
ru_ru: Очищает по всему проекту артефакты сборки и временные файлы, попавшие под правила ignore.
zh_hans: 按 ignore 规则清理项目中的构建产物和临时文件。

# WarningsPaneTitleText.Text
source: Warnings
ja_jp: 警告
ru_ru: Предупреждения
zh_hans: 警告

# MainDescriptionText.Text
source: Clean ignored build artifacts and temporary files across your project tree.
ja_jp: プロジェクト全体で、ignore ルールに一致したビルド成果物や一時ファイルをまとめて整理します。
ru_ru: Удаляет по всему проекту артефакты сборки и временные файлы, попавшие под правила ignore.
zh_hans: 清理项目中被 ignore 规则命中的构建产物和临时文件。

# RootFolderTextBox.Header
source: Root folder
ja_jp: ルート フォルダー
ru_ru: Корневая папка
zh_hans: 根目录

# RootFolderTextBox.PlaceholderText
source: Choose a folder to scan
ja_jp: スキャン対象のフォルダーを選択
ru_ru: Выберите папку для сканирования
zh_hans: 选择要扫描的目录

# BrowseButton.Content
source: Browse
ja_jp: 参照
ru_ru: Обзор
zh_hans: 浏览

# IgnoreFileNamesTextBox.Header
source: Ignore file names
ja_jp: ignore ファイル名
ru_ru: Имена ignore-файлов
zh_hans: ignore 文件名

# IgnoreFileNamesTextBox.Description
source: Semicolon-separated list (e.g. .gitignore)
ja_jp: セミコロン区切り（例: .gitignore）
ru_ru: Через точку с запятой, например: .gitignore
zh_hans: 用分号分隔（例如 .gitignore）

# ScanExclusionsTitleText.Text
source: Scan exclusions
ja_jp: スキャン対象から除外
ru_ru: Исключения сканирования
zh_hans: 扫描排除项

# EditExclusionsButton.Content
source: Edit
ja_jp: 編集
ru_ru: Изменить
zh_hans: 编辑

# DeleteSelectedText.Text
source: Delete Selected
ja_jp: 選択項目を削除
ru_ru: Удалить выбранное
zh_hans: 删除所选项

# ClearText.Text
source: Clear
ja_jp: クリア
ru_ru: Очистить
zh_hans: 清空

# PermanentlyDeleteCheckBox.Content
source: Permanently delete
ja_jp: 完全削除
ru_ru: Удалять безвозвратно
zh_hans: 永久删除

# WarningsInfoBar.Title
source: Warnings
ja_jp: 警告
ru_ru: Предупреждения
zh_hans: 警告

# ViewErrorsButton.Content
source: View Details
ja_jp: 詳細を表示
ru_ru: Показать детали
zh_hans: 查看详情

# SuccessInfoBar.Title
source: Completed
ja_jp: 完了
ru_ru: Готово
zh_hans: 完成

# OpenInExplorerMenuItem.Text
source: Open in File Explorer
ja_jp: エクスプローラーで開く
ru_ru: Открыть в Проводнике
zh_hans: 在文件资源管理器中打开

# OpenIgnoreFileMenuItem.Text
source: Open Rule Source File
ja_jp: ルール元のファイルを開く
ru_ru: Открыть файл правила
zh_hans: 打开规则来源文件

# EmptyStateText.Text
source: No items to display. Select a folder and scan.
ja_jp: 表示する項目はありません。フォルダーを選んでスキャンしてください。
ru_ru: Пока ничего не найдено. Выберите папку и запустите сканирование.
zh_hans: 没有可显示的内容。请选择目录并开始扫描。

# SettingsButton.Label
source: Settings
ja_jp: 設定
ru_ru: Параметры
zh_hans: 设置

# SettingsButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Settings
ja_jp: 設定
ru_ru: Параметры
zh_hans: 设置

# SettingsButtonLabel
source: Settings
ja_jp: 設定
ru_ru: Параметры
zh_hans: 设置

# SettingsButtonToolTip
source: Settings
ja_jp: 設定
ru_ru: Параметры
zh_hans: 设置

# SettingsTitleText.Text
source: Settings
ja_jp: 設定
ru_ru: Параметры
zh_hans: 设置

# DisplayLanguageSettingsCard.Header
source: Display language
ja_jp: 表示言語
ru_ru: Язык интерфейса
zh_hans: 界面语言

# DisplayLanguageCardHeader
source: Display language
ja_jp: 表示言語
ru_ru: Язык интерфейса
zh_hans: 界面语言

# LicenseLink.Content
source: MIT license
ja_jp: MIT ライセンス
ru_ru: Лицензия MIT
zh_hans: MIT 许可证

# RepositoryLink.Content
source: Star the repo
ja_jp: リポジトリに Star を付ける
ru_ru: Поставить звезду
zh_hans: 给仓库点个 Star

# ActionScan
source: Scan
ja_jp: スキャン
ru_ru: Сканировать
zh_hans: 扫描

# ActionCancel
source: Cancel
ja_jp: キャンセル
ru_ru: Отмена
zh_hans: 取消

# SettingsVersionFormat
source: Version {0}
ja_jp: バージョン {0}
ru_ru: Версия {0}
zh_hans: 版本 {0}

# SettingsLanguageSystemDefault
source: Use system language
ja_jp: システム設定に合わせる
ru_ru: Как в системе
zh_hans: 跟随系统语言

# DialogOk
source: OK
zh_hans: 确定

# DialogCancel
source: Cancel
ja_jp: キャンセル
ru_ru: Отмена
zh_hans: 取消

# DialogSave
source: Save
ja_jp: 保存
ru_ru: Сохранить
zh_hans: 保存

# DialogDelete
source: Delete
ja_jp: 削除
ru_ru: Удалить
zh_hans: 删除

# DialogMoveToTrash
source: Move to Trash
ja_jp: ごみ箱へ移動
ru_ru: Переместить в корзину
zh_hans: 移到回收站

# StatusReady
source: Ready
ja_jp: 準備完了
ru_ru: Готово
zh_hans: 就绪

# SummaryIdle
source: Select a root folder and scan to preview deletions.
ja_jp: ルート フォルダーを選んでスキャンすると、削除候補を確認できます。
ru_ru: Выберите корневую папку и запустите сканирование, чтобы увидеть, что можно очистить.
zh_hans: 选择根目录并扫描，预览可清理的内容。

# StatusRefreshingProgress
source: Refreshing results... {0} items processed
ja_jp: 結果を更新中... {0} 件処理済み
ru_ru: Обновление результатов... обработано {0}
zh_hans: 正在刷新结果... 已处理 {0} 项

# SummaryNoMatches
source: No ignored files or directories were found.
ja_jp: クリーンアップ対象の ignore ファイルやフォルダーは見つかりませんでした。
ru_ru: Подходящих ignore-файлов и папок не найдено.
zh_hans: 没有找到可清理的 ignore 文件或目录。

# SummaryMatches
source: {0} path(s) matched, {1} total size.
ja_jp: {0} 件の候補が見つかりました（合計 {1}）。
ru_ru: Найдено {0} совпадений, общий размер {1}.
zh_hans: 找到 {0} 个匹配路径，总大小 {1}。

# ExclusionsDialogPrompt
source: Enter folder names to skip during scanning (one per line):
ja_jp: スキャンから除外するフォルダー名を入力してください（1 行に 1 つ）:
ru_ru: Введите имена папок, которые нужно пропускать при сканировании (по одной на строку):
zh_hans: 输入扫描时要跳过的目录名（每行一个）：

# ExclusionsDialogTitle
source: Manage Scan Exclusions
ja_jp: スキャン除外の管理
ru_ru: Управление исключениями сканирования
zh_hans: 管理扫描排除项

# StatusCancelingScan
source: Canceling scan...
ja_jp: スキャンを取り消しています...
ru_ru: Отмена сканирования...
zh_hans: 正在取消扫描...

# MessageInvalidRootScan
source: Select a valid root folder before scanning.
ja_jp: スキャンする前に有効なルート フォルダーを選択してください。
ru_ru: Перед сканированием выберите корректную корневую папку.
zh_hans: 请先选择有效的根目录再开始扫描。

# StatusScanning
source: Scanning...
ja_jp: スキャン中...
ru_ru: Сканирование...
zh_hans: 正在扫描...

# StatusScanningProgress
source: Scanning... {0} items processed
ja_jp: スキャン中... {0} 件処理済み
ru_ru: Сканирование... обработано {0}
zh_hans: 正在扫描... 已处理 {0} 项

# StatusScanCompleted
source: Scan completed.
ja_jp: スキャンが完了しました。
ru_ru: Сканирование завершено.
zh_hans: 扫描完成。

# StatusScanCompletedWithWarnings
source: Scan completed with warnings.
ja_jp: 警告付きでスキャンが完了しました。
ru_ru: Сканирование завершено с предупреждениями.
zh_hans: 扫描完成，但有警告。

# SuccessFoundItems
source: Found {0} path(s) totaling {1}.
ja_jp: {0} 件の候補が見つかりました（合計 {1}）。
ru_ru: Найдено {0} совпадений, общий размер {1}.
zh_hans: 找到 {0} 个匹配路径，总大小 {1}。

# StatusScanCanceled
source: Scan canceled.
ja_jp: スキャンを取り消しました。
ru_ru: Сканирование отменено.
zh_hans: 扫描已取消。

# SummaryScanCanceled
source: Scan canceled before results were finalized.
ja_jp: 結果の確定前にスキャンが取り消されました。
ru_ru: Сканирование отменено до завершения формирования результатов.
zh_hans: 在结果最终生成前已取消扫描。

# StatusScanFailed
source: Scan failed.
ja_jp: スキャンに失敗しました。
ru_ru: Сканирование не удалось.
zh_hans: 扫描失败。

# MessageInvalidRootDelete
source: Select a valid root folder before deleting.
ja_jp: 削除する前に有効なルート フォルダーを選択してください。
ru_ru: Перед удалением выберите корректную корневую папку.
zh_hans: 请先选择有效的根目录再删除。

# MessageNoItemsSelected
source: No items are selected for deletion.
ja_jp: 削除する項目が選択されていません。
ru_ru: Не выбраны элементы для удаления.
zh_hans: 未选择要删除的项目。

# ConfirmPermanentDeleteTitle
source: Confirm permanent delete
ja_jp: 完全削除の確認
ru_ru: Подтвердите безвозвратное удаление
zh_hans: 确认永久删除

# ConfirmReversibleDeleteTitle
source: Confirm move to trash
ja_jp: ごみ箱へ移動してよろしいですか
ru_ru: Подтвердите перемещение в корзину
zh_hans: 确认移到回收站

# ConfirmPermanentDeleteContent
source: Delete {0} selected path(s) totaling {1} permanently? This action can't be undone.
ja_jp: 選択した {0} 件のパス（合計 {1}）を完全に削除しますか？この操作は元に戻せません。
ru_ru: Безвозвратно удалить выбранные пути: {0}; общий размер: {1}? Это действие нельзя отменить.
zh_hans: 要永久删除所选的 {0} 个路径（共 {1}）吗？此操作无法撤销。

# ConfirmReversibleDeleteContent
source: Move {0} selected path(s) totaling {1} to trash?
ja_jp: 選択した {0} 件のパス（合計 {1}）をごみ箱へ移動しますか？
ru_ru: Переместить выбранные пути ({0}, {1}) в корзину?
zh_hans: 要将所选的 {0} 个路径（共 {1}）移到回收站吗？

# StatusDeleting
source: Deleting...
ja_jp: 削除中...
ru_ru: Удаление...
zh_hans: 正在删除...

# StatusDeletingProgress
source: Deleting... {0}/{1}
ja_jp: 削除中... {0}/{1}
ru_ru: Удаление... {0}/{1}
zh_hans: 正在删除... {0}/{1}

# SummaryDeleteRefreshFailed
source: Items changed, but refreshing the current results failed. Run Scan again.
ja_jp: 内容は変更されましたが、現在の結果を更新できませんでした。もう一度スキャンしてください。
ru_ru: Файлы изменены, но обновить текущие результаты не удалось. Запустите сканирование ещё раз.
zh_hans: 项目已更改，但刷新当前结果失败。请重新扫描。

# ErrorDeleteRefreshFailed
source: Deleted items, but refreshing the current results failed: {0}
ja_jp: 削除は完了しましたが、現在の結果を更新できませんでした: {0}
ru_ru: Удаление завершено, но обновить текущие результаты не удалось: {0}
zh_hans: 已删除项目，但刷新当前结果失败：{0}

# SuccessDeleted
source: Deleted {0} path(s) totaling {1}.
ja_jp: {0} 件を削除しました（合計 {1}）。
ru_ru: Удалено {0} путей, общий размер {1}.
zh_hans: 已删除 {0} 个路径（共 {1}）。

# SuccessMovedToTrash
source: Moved {0} path(s) totaling {1} to trash.
ja_jp: {0} 件（合計 {1}）をごみ箱へ移動しました。
ru_ru: {0} путей перемещено в корзину, общий размер {1}.
zh_hans: 已将 {0} 个路径（共 {1}）移到回收站。

# StatusDeleteFailed
source: Delete failed.
ja_jp: 削除に失敗しました。
ru_ru: Удаление не удалось.
zh_hans: 删除失败。

# StatusDeleteCompletedWithWarnings
source: Delete completed with warnings.
ja_jp: 警告付きで削除が完了しました。
ru_ru: Удаление завершено с предупреждениями.
zh_hans: 删除完成，但有警告。

# StatusDeleteCompleted
source: Delete completed.
ja_jp: 削除が完了しました。
ru_ru: Удаление завершено.
zh_hans: 删除完成。

# ErrorSummaryMore
source: {0} more
ja_jp: ほか {0} 件
ru_ru: ещё {0}
zh_hans: 另外 {0} 项

# MessageNoIgnoreFileAssociated
source: No ignore file associated with this item.
ja_jp: この項目には関連する ignore ファイルがありません。
ru_ru: С этим элементом не связан ни один ignore-файл.
zh_hans: 此项没有关联的 ignore 文件。

# DialogSelectIgnoreFile
source: Select Ignore File
ja_jp: Ignore ファイルを選択
ru_ru: Выберите ignore-файл
zh_hans: 选择 Ignore 文件

# ErrorOpenFileFailed
source: Failed to open file: {0}
ja_jp: ファイルを開けませんでした: {0}
ru_ru: Не удалось открыть файл: {0}
zh_hans: 打开文件失败：{0}

# ErrorOpenLinkFailed
source: Failed to open link: {0}
ja_jp: リンクを開けませんでした: {0}
ru_ru: Не удалось открыть ссылку: {0}
zh_hans: 打开链接失败：{0}

# LanguagePreferenceSaveFailed
source: Failed to save the language preference: {0}
ja_jp: 言語設定を保存できませんでした: {0}
ru_ru: Не удалось сохранить языковой параметр: {0}
zh_hans: 保存语言偏好设置失败：{0}

# LanguageRestartFailed
source: Couldn't restart the app automatically. Restart it manually to apply the new display language. ({0})
ja_jp: アプリを自動で再起動できませんでした。新しい表示言語を反映するには、手動で再起動してください。（{0}）
ru_ru: Не удалось автоматически перезапустить приложение. Перезапустите его вручную, чтобы применить новый язык интерфейса. ({0})
zh_hans: 无法自动重新启动应用。请手动重启以应用新的界面语言。（{0}）

# ErrorReadDirectory
source: Failed to read {0}: {1}
ja_jp: {0} を読み取れませんでした: {1}
ru_ru: Не удалось прочитать {0}: {1}
zh_hans: 读取 {0} 失败：{1}

# ErrorInspectEntry
source: Failed to inspect {0}: {1}
ja_jp: {0} を確認できませんでした: {1}
ru_ru: Не удалось проверить {0}: {1}
zh_hans: 检查 {0} 失败：{1}

# ErrorReadIgnoreFile
source: Failed to read ignore file {0}: {1}
ja_jp: ignore ファイル {0} を読み取れませんでした: {1}
ru_ru: Не удалось прочитать ignore-файл {0}: {1}
zh_hans: 读取 ignore 文件 {0} 失败：{1}

# ErrorDeletePath
source: Failed to delete {0}: {1}
ja_jp: {0} を削除できませんでした: {1}
ru_ru: Не удалось удалить {0}: {1}
zh_hans: 删除 {0} 失败：{1}

# ErrorMoveToRecycleBin
source: Failed to move {0} to the Recycle Bin: {1}
ja_jp: {0} をシステムのごみ箱へ移動できませんでした: {1}
ru_ru: Не удалось переместить {0} в системную Корзину: {1}
zh_hans: 将 {0} 移到系统回收站失败：{1}

# ErrorMoveToRecycleBinAborted
source: The operation was canceled or blocked by Windows.
ja_jp: 操作は Windows によって中止またはブロックされました。
ru_ru: Операция была отменена или заблокирована Windows.
zh_hans: 操作已被 Windows 取消或阻止。

# ErrorShellOperationCode
source: Shell operation failed with code
ja_jp: Shell 操作が失敗しました。コード:
ru_ru: Сбой shell-операции, код
zh_hans: Shell 操作失败，错误代码

# ErrorIgnoreFileNoParent
source: Ignore file has no parent directory.
ja_jp: ignore ファイルに親フォルダーがありません。
ru_ru: У ignore-файла нет родительской папки.
zh_hans: Ignore 文件没有父目录。

# ErrorReadFileSize
source: Failed to read size for {0}: {1}
ja_jp: {0} のサイズを読み取れませんでした: {1}
ru_ru: Не удалось прочитать размер для {0}: {1}
zh_hans: 读取 {0} 的大小失败：{1}

# HintContainsMatches
source: contains matches
ja_jp: 一致する項目あり
ru_ru: есть совпадения
zh_hans: 包含匹配内容
